In [1]:
import pandas as pd

In [3]:
A = pd.DataFrame({
                    'AID ': [1,2,3,4,5],
                    'ANAME' : ['Mohit', 'Sumit', 'amit', 'preeti', 'Rohit'],
                    'ACITY' : ['Indore', 'Jaipur', 'Delhi', 'Hyderabad', 'Warangal']
})

In [9]:
B = pd.DataFrame({
                    'BID': [11,12,13,14,15,16],
                    'BNAME' : ['Sheela', 'Maya', 'Riya', 'Shina', 'Meena', 'Rohit'],
                    'BCITY' : ['Mumbai', 'Pune', 'Nasik', 'Sangli', 'Satara', 'Warangal']
})

In [27]:
C = pd.DataFrame({   
                    'BID' : [11, 12, 13, 14],
                    'CID': [21,22,23,24],
                    'Age' : [17,19, 21, 23]
                    
})

In [29]:
A

   AID    ANAME      ACITY
0     1   Mohit     Indore
1     2   Sumit     Jaipur
2     3    amit      Delhi
3     4  preeti  Hyderabad
4     5   Rohit   Warangal

In [31]:
B

   BID   BNAME     BCITY
0   11  Sheela    Mumbai
1   12    Maya      Pune
2   13    Riya     Nasik
3   14   Shina    Sangli
4   15   Meena    Satara
5   16   Rohit  Warangal

In [33]:
C

   BID  CID  Age
0   11   21   17
1   12   22   19
2   13   23   21
3   14   24   23